// 点击量饼图数据
const clickLabel = ["哔哩哔哩(大号 播放量)", "哔哩哔哩(大号 阅读量)", "哔哩哔哩(小号 播放量)", "哔哩哔哩(小号 阅读量)", "知乎", "CSDN", "VSMarketplace"];
const clickData = [251418, 52928, 194307, 54676, 134669, 267040, 71631];

// 点击量求和
var clickAll = 0;
for (let i = 0; i < clickData.length; i++) {
    clickAll += clickData[i];
}

// 粉丝量饼图数据
const followerLabel = ["哔哩哔哩(大号)", "哔哩哔哩(小号)", "知乎", "CSDN"];
const followerData = [1306, 479, 62, 223];

// 点击量求和
var followerAll = 0;
for (let i = 0; i < followerData.length; i++) {
    followerAll += followerData[i];
}

// 饼图背景色
const doughnutBackgroundColor = ["rgba(255, 99, 132)", "rgba(255, 159, 64)", "rgba(255, 205, 86)", "rgba(75, 192, 192)", "rgba(54, 162, 235)", "rgba(153, 102, 255)", "rgba(201, 203, 207)"]

// VSCode扩展折线图数据
const date = ["5月22日", "5月23日", "5月24日", "5月25日", "5月26日", "5月27日", "5月28日",
    "5月29日", "5月30日", "5月31日", "6月1日", "6月2日", "6月3日"];
const jeiData = [3381, 3405, 3429, 3453, 3477, 3501, 3525,
    3549, 3573, 3597, 3621, 3645, 3700];
const pdData = [3194, 3225, 3256, 3287, 3318, 3349, 3380,
    3411, 3442, 3473, 3504, 3535, 3577];
const vsbData = [15456, 15695, 15934, 16173, 16412, 16651, 16890,
    17129, 17368, 17607, 17846, 18070, 18234];
const jpiData = [12370, 12530, 12690, 12882, 13074, 13266, 13458,
    13650, 13842, 14034, 14240, 14460, 14757,];
const cjsData = [1801, 1842, 1883, 1924, 1965, 2006, 2047,
    2088, 2129, 2170, 2211, 2248, 2262]